#include <stdio.h>

int main(void) {
	int num;
	printf("정수 입력 : ");
	scanf_s("%d", &num);

	if (num < 0) // num이 0보다 작으면 아래의 문장 실행
		printf("입력 값은 0보다 작다 \n");

	if (num > 0) // num이 0보다 크면 아래의 문장 실행
		printf("입력 값은 0보다 크다 \n");

	if (num == 0) // num이 0이면 아래의 문장 실행
		printf("입력 값은 0이다. \n");

	return 0;
}

/*
흐름의 분기가 필요한 이유
사칙연산이 가능한 계산기 프로그램을 구현한다고 가정해보면 이 프로그램은 사칙연상이 모두 가능해야 하며,
선택적 실행이 가능해야 한다. => 자신의 필요에 따라서 덧셈 혹은 곱셈을 선택적으로 실행할 수 있어야 한다.
하지만 우리가 지금까지 공부한 내용을 가지고는 사칙연산의 결과 전부를 출력할 수는 있어도, 선택적 실행은 불가능하다.
프로그램의 흐름을 분기시킬 줄 모르기 때문이다.
선택적 실행이 가능한 계산기 프로그램의 구현을 위해서는 프로그램의 흐름을 분기시킬 수 있어야 한다.

if문을 이용한 조건적 실행
if (num1 > num2) { // num1이 num2보다 크다면 아래의 중괄호를 실행한다.
   printf("num1이 num2보다 큽니다. \n");
   printf("%d > %d \n", num1, num2);
}

다음과 같이 중괄호는 생략이 가능하다
if (num1 > num2) // num1이 num2보다 크다면 아래의 문장을 실행한다.
   printf("num1이 num2보다 큽니다. \n");
*/