#include <stdio.h>

int main(void) {
	int num, abs;
	printf("정수 입력 : ");
	scanf_s("%d", &num);

	abs = num > 0 ? num : num*(-1);
	printf("절댓값 : %d \n", abs);

	return 0;
}

/*
조건 연산자 : 피 연산자가 세 개인 '삼 항 연산자'
if~else문을 일부 대체할 수 있는 조건 연산자
이 연산자는 피연산자의 수가 세개이기 때문에 '삼 항 연산자'로도 불린다.

(num1 > num2) ? (num1) : (num2)
이해를 돕기 위해 세 개의 연산자에 소괄호를 하였다.(따라서 소괄호는 생략 가능하다)
즉, 조건 연산자는 기호 ? 와 기호 : 으로 이뤄진다. 이렇듯 두 개의 기호가 서로 떨어져서 하나의 연산자를 구성하기 때문에
피연산자를 3개까지 둘 수 있는 것이다. 위의 조건 연산자 문장을 다음과 같이 다시 쓰겠다.

(조건) ? data1 : data2
조건이 '참'이면 연산결과로 data1이 반환되고, 조건이 '거짓'이면 연산결과로 data2가 반환된다.
따라서 다음과 같은 형태로 조건 연산자를 구성할 수 있다.

int num3 = (num1 > num2) ? (num1) : (num2);
이 경우, 대입 연산자보다 조건 연산자의 우선순위가 높으므로 조건 연산자가 먼저 진행된다.
따라서 num1 > num2가 '참'이라면 연산 결과로 num1이 반횐되어,(조건 연산문 전부를 num1이 대체한다고 생각하면 된다.) 다음의 형태가 된다.

int num3 = num1;
반대로 num1 > num2가 '거짓'이라면 연산의 결과로 num2가 반환되어 다음의 형태가 된다.

int num3 = num2;

위 예제 8행에서 보이는 바와 같이 조건의 만족여부에 따라서 반환해야 할 값을 명시할 위치에
num*(-1)과 같은 연산식이 올 수 있으며, 이러한 경우 연산식의 계산결과가 반환이 된다.
즉, 위 예제 8행의 경우 num > 0이 거짓이라면 num*(-1) 연산의 결과가 반환되어서, 변수 abs를 초기화하게 된다.

참고
- 조건 연산자는 영 어색한데요.
조건 연산자는 간단한 if~else문을 대신할 수 있는 연산자로 C 프로그래머들이 선호하는 연산자이다.
사실 처음 접하면 매우 어색한 연산자 중 하나인데, 익숙해지고 또 자주 사용하다 보면,
코드를 간결히 하는데 한몫 제대로 한다는 것을 알게 될 것이다.
*/