#include <stdio.h>

int main(void) {
	int num;
	printf("자연수 입력 : ");
	scanf_s("%d", &num);

	if (num == 1)
		goto ONE;
	else if (num == 2)
		goto TWO;
	else
		goto OTHER;

ONE:
	printf("1을 입력하셨습니다! \n");
	goto END;
TWO:
	printf("2를 입력하셨습니다! \n");
	goto END;
OTHER:
	printf("3 혹은 다른 값을 입력하셨군요! \n");

END:
	return 0;
}

/*
goto는 그 이름이 의미하듯이 프로그램의 흐름을 원하는 위치로 이동시킬 때 사용하는 키워드이다.
goto의 사용을 부정적으로 보는 이유
goto문의 가장 큰 단점은 '프로그램의 자연스러운 흐름을 방행한다'는 것이다.
C언어와 같은 절차지향 프로그래밍 언어에서 프로그램의 흐름을 방해하거나 복잡하게 하는 것은 아주 큰 단점이 된다.
그만큼 단순한 흐름이 중요하기 때문이다. 그런데다가 goto문을 써야만 해결할 수 있는 문제의 상황도 딱히 존재하지 않는다.
물론 goto문을 써서 개선시킬 수 있는 상황이 아예 없는 것은 아니지만, 극히 제한적이며 또 설득력이 강한 것도 아니다.
그래서 사람들은 이러한 goto문의 사용을 가급적 자제하거나 아예 사용하지 말자고 결론을 내리게 되었다.
어차피 사용하지 않을 거라면 그냥 넘어가도 되지만, 알고 사용하지 않는 것과 모르고 사용하지 않는 것에는 차이가 있는듯하여
간단하게나마 goto문에 대해 설명하고자 한다. 참고로 이는 goto문의 사용을 장려하기 위한 것은 아니다.

goto문의 기본 구성
int main(void) {
     ......
rabbit: // 위치지정에 사용된 rabbit이라는 이름의 레이블
     ......
   goto rabbit; // 레이블 rabbit의 위치로 이동!
     ......
}

이동의 위치는 레이블로 표시한다. 해당 레이블을 대상으로 goto문을 구성하게 된다.

레이블은 실행의 대상이 아닌, 위치를 표시하는 역할로 사용되는 표식이기 때문에 대부분의 편집기상에서 왼쪽 정렬을 시킨다.
그래서 프로그래머들이 레이블을 쉽게 구분할 수 있도록 돕는다.
*/