#include <stdio.h>

int main(void) {
	int total = 0;
	int i, num;
	printf("0부터 num까지의 덧셈, num은? : ");
	scanf_s("%d", &num);

	for (i = 0; i < num + 1; i++) // i <= num도 가능
     // for (int i = 0; i < num + 1; i++)도 가능하나 지원하지 않는 컴파일러도 존재하기 때문에 for문 밖에서 변수를 선언해야 한다.
		total += i;

	printf("0부터 %d까지 덧셈결과 : %d \n", num, total);
	return 0;
}

/*
int main(void) {
	int num = 0;       // 필수요소 1. 반복을 위한 변수의 선언
	while (num < 3){   // 필수요소 2. 반복의 조건검사
	    printf("Hi~"); // 필수요소 3. 반복의 조건을 '거짓'으로 만들기 위한 연산
	    num++;
	}
}
=> "필수요소 1, 2, 3을 한 데(한 줄에) 묶을 순 없을까?" => 이 세가지 요소를 한 데 묶어 놓으면, 반복문의 반복횟수를 판단하기가 한결 수월해진다.
=> 이 생각을 반영해서 만든 것이 for문이다.

필수요소 1   초기식   반복을 위한 변수의 선언 및 초기화에 사용
필수요소 2   조건식   반복의 조건을 검사하는 목적으로 선언됨
필수요소 3   증감식   반복의 조건을 '거짓'으로 만드는 증가 및 감소연산

for ( 초기식 ; 조건식 ; 증감식) {
    // 반복의 대상이 되는 문장들
}

int main(void) {
	for (int num=0 ; num<3 ; num++)
	     printf("Hi~"); // 반복의 대상이 한 줄이므로 중괄호 생략!
}

초기식 - 본격적으로 반복을 시작하기에 앞서 딱 한번 실행된다.
조건식 - 매 반복의 시작에 앞서 실행되며, 그 결과를 기반으로 반복유무를 결정!
증감식 - 매 반복실행 후 마지막에 연산이 이뤄진다.

int num = 0에 해당하는 초기화는 반복문의 시작에 앞서 딱 1회 진행된다.
num < 3에 해당하는 조건의 검사는 매 반복문의 시작에 앞서 진행된다.
num++에 해당하는 증감연산은 반복영역을 실행한 후에 진행된다.
"for문의 실행방식은 구조적으로 while문의 실행방식과 동일하다."

for문은 while문에 비해서 유연한 느낌을 주지 못하다. 반복의 횟수가 딱 정해진 경우라면 분명 for문이 최선이다.
하지만 반복의 횟수가 딱 정해지지 않은 경우라면,
예를 들어서 프로그램 사용자가 임의의 값을 입력하기만 기다리는 상황이라면, for문보다는 while문이 더 자연스러울 수 있다.
*/
