#include <stdio.h>

int main(void) {
	int num1, num2;
	
	num1 = printf("12345\n");
	num2 = printf("I love my home\n");
	printf("%d %d \n", num1, num2);
	
	return 0; 
} 

/*
"Divide and Conquer!" 나누어서 정복하라! 
복잡한 문제를 main이라는 하나의 함수로 정복하려 들지 말고,
작은 크기의 함수들로 나누어서 정복하라는 뜻으로 이해할 수 있다. 
프로그램을 작은 크기의 함수들로 나눠서 구현하게 되면,
문제의 발생 및 프로그램의 요구사항 변경으로 인한 소스코드의 변경이 필요한 경우에,
변경의 범위를 축소 및 제한할 수 있다.

Chapter 02에서는 입력(전달인자)와 그에 따른 적절한 출력(반환 값)이 존재하는 것이 함수라 하였다.
그러나 C언어의 함수는 전달인자가 없거나 반환 값이 없는 경우도 있다. 물론 둘 다 없는 경우도 존재한다.
printf 함수를 예로 들어보자면, 전달되는 인자정보들을 참조하여 데이터를 모니터에 출력하는 기능을 지닌다.
따라서 굳이 값을 반환할 필요가 없어 보인다. 실제로 값을 반환하지 않는다고 해서 문제될 것도 없다.
그래도 여전히 함수라 할 수 있으며 모니터에 뿌려지는 데이터들을, 값의 반환을 대신하는 출력의 일종으로 볼 수 있다.
이렇듯 불필요하다면 입력이나 출력이 존재하지 않는 형태의 함수를 정의하는 것도 가능하다.

"입력 또는 출력이 없는 함수도 존재한다(만들 수 있다)." 
printf 함수는 실제로 값을 반환하지 않을까? => printf 함수도 실제로는 값을 반환한다.
실행결과에서 보이듯이 printf 함수는 \n 문자를 포함하여 모니터에 출력한 문자열의 길이를 반환한다.

참고
- 한글은 운영체제에 따라 다르게 표현됩니다.
windows는 한글을 2바이트로 표현하기 때문에 windows에서의 printf 함수는 한글 하나당 그 길이를 2로 계산한다. 
물론 이는 운영체제에 따라 달라지기 때문에 운영체제 별로 출력결과를 확인할 필요가 있다. 
*/
