#include <stdio.h>

int Add(int num1, int num2) {
	return num1 + num2;
}

int main(void) {
	int result;
	
	result = Add(3, 4);
	printf("덧셈 결과 1 : %d \n", result);
	
	result = Add(5, 8);
	printf("덧셈 결과 2 : %d \n", result);
	
	return 0;
}

/*
전달인자의 유무와 반환 값의 유무에 따라서 함수를 네 개의 형태로 나눕시다.
함수의 이름을 정하고, 기능을 구현하고, 전달인자와 반환 값을 결정짓는 것이 함수를 정의하는 것이다.
여기서는 다양한 형태의 함수를 정의해 봄으로써 우리들 스스로가 필요한 함수를 정의할 수 있는 능력을 키워보고자 한다.

* 유형 1 : 전달인자 있고, 반환 값 있다! 전달인자(O), 반환 값(O) 
* 유형 2 : 전달인자 있고, 반환 값 없다! 전달인자(O), 반환 값(X) 
* 유형 3 : 전달인자 없고, 반환 값 있다! 전달인자(X), 반환 값(O) 
* 유형 4 : 전달인자 없고, 반환 값 없다! 전달인자(X), 반환 값(X)

다양한 형태의 함수 정의 1 : 전달인자와 반환 값이 모두 있는 경우 
가장 일반적인 형태의 함수 
여기서는 덧셈 기능을 지니는 함수를 정의해보겠다.
일단 전달인자는 두 개가 되어야 한다. 덧셈이라는 것이 둘 이상의 수를 더하는 것 아닌가?
그리고 반환 값도 존재해야 한다. 덧셈을 했다면 그에 따른 결과를 반환해야 할 것 아닌가?
그래서 구현할 함수의 특징을 다음과 같이 정리하였다.

* 전달인자는 int형 정수 둘이며, 이 둘을 이용한 덧셈을 진행한다.
* 덧셈결과는 반환이 되며, 따라서 반환형도 int형으로 선언한다.
* 마지막으로 함수의 이름은 Add라 하자!
          ▼ 
int Add(int num1, int num2) {
   int result = num1 + num2;
   return result; // result에 저장된 값을 Add 함수를 호출한 영역으로 전달 
}

int = 반환형 Add = 함수의 이름 (int num1, int num2) = 매개변수 return result = 값의 반환 
먼저 이야기할 것은 '매개변수의 선언'이다. 이는 함수호출 시 전달되는 인자를 저장할 변수의 선언이다.
함수 몸체에서 첫 번째 행에서 하는 일은 num1과 num2의 값을 더해서 그 결과를 변수 result에 저장하는 일이다.
result에 저장된 값을 return result에서 반환한다. 그런데 반환되는 값의 자료형이 int형이므로 
반환형이 int형으로 선언되었다. 마지막으로 지금까지 설명한 함수의 이름 Add가 명시되어 있다. 
참고로 함수호출 시 전달할 수 있는 인자의 수는 여러 개가 될 수 있지만 반환할 수 있는 값의 수는 하나이다.
따라서 반환의 대상을 결정할 때 더 신경을 써야 한다. 

return num1 + num2;
이렇듯 매개변수를 대상으로 직접 덧셈연산을 하여 그 결과를 바로 반환할 수도 있다.
이러한 경우 num1과 num2를 대상으로 먼저 덧셈연산이 이뤄지고, 그 때 얻어지는 결과 값을 반환하게 된다.

result = Add(3, 4);
값이 반환된다는 것은 함수의 호출문이 반환 값으로 대체되는 것으로 이해할 수 있다.
즉, 위의 문장에서 Add함수가 종료되면서 7을 반환하면 다음과 같이 대입연산만 남은 형태가 된다.

result = 7;
그래서 변수 result에는 7이 저장되는 것이다.

함수가 호출되면 호출된 함수의 영역으로 실행의 흐름이 이동한다.
물론 호출된 함수가 반환을 하면, 잠시 멈췄던 main 함수의 실행흐름은 다시 이어지게 된다.
그리고 한 번 정의된 함수는 몇 번이고 반복 호출할 수 있다. 
*/
