#include <stdio.h>

int main(void) {
	int cnt;

	for (cnt = 0; cnt < 3; cnt++) {
		int num = 0;
		num++;
		printf("%d번째 반복, 지역변수 num은 %d. \n", cnt + 1, num);
	}

	if (cnt == 3) {
		int num = 7;
		num++;
		printf("if문 내에 존재하는 지역변수 num은 %d. \n", num);
	}

	return 0;
}

/*
반복문이나 조건문에도 중괄호는 존재할 수 있다. 즉, 지역변수는 반복문이나 조건문에도 선언이 가능하다.

제일 먼저 선언된 지역변수는 cnt이다. 이 변수는 main 함수의 시작부분에서 선언되었다.
따라서 main 함수 내에서는 어디서든 접근 가능하다.
for문 내에서도, if문 내에서도 접근 가능하다. 출력 결과를 통해서 이러한 사실을 확인할 수 있다.
7행에 선언된 지역변수 num을 보자! 이 변수는 for문의 중괄호 내에 선언되었기 때문에 for문 내에서 유효한 지역변수가 된다.
for문에 의한 반복이 중괄호 내에서 이뤄지는 것이 아니라, 중괄호의 진입과 탈출을 반복하면서 이뤄지는 것임을 말하고 있다.
따라서 반복이 이뤄질 때마다 변수 num은 메모리상에 할당되고 소멸된다. 그래서 출력 결과는 항상 1이다.
마지막으로 세 번째 지역변수는 13행에서 선언된다. 비록 if문 내에 선언되었지만 이 역시 중괄호 내에 선언되었으므로
if문 내에서만 유효한 지역변수가 된다. 따라서 if문을 벗어나면 소멸되는 지역변수이다.
다음 예제를 통해 다음의 사실을 확인하고자 한다.

"지역변수는 외부에 선언된 동일한 이름의 변수를 가리게 됩니다."
*/