#include <stdio.h>

int main(void) {
	int num = 1;

	if (num == 1) {
		int num = 7; // 이 행을 주석처리 하고 실행결과 확인하자!
		num += 10;
		printf("if문 내 지역변수 num : %d \n", num);
	}

	printf("main 함수 내 지역변수 num : %d \n", num);

	return 0;
}

/*
주석처리 할 시 num의 값이 모두 11로 나온다.

위 예제의 4행에 지역변수 num이 선언되었다. 따라서 이 변수는 main 함수 내에서 접근 가능하다.
그런데 if문의 내부인 7행에서 동일한 이름의 변수 num이 선언되었다.
이러한 경우 if문 내에서는 main 함수의 num이 가리워진다. 때문에 8행에서 접근하는 num은
4행의 num이 아닌 7행의 num이 된다. 물론 7행의 변수 선언이 없었다면, 8행에서 접근하는 num은 4행의 num이 된다.

지역변수의 일종인 매개변수!
함수를 정의할 때 선언하는 매개변수도 지역변수의 일종이다. 따라서 매개변수 역시 지역변수의 다음 특성을 지닌다.

* 선언된 함수 내에서만 접근이 가능하다.
* 선언된 함수가 반환을 하면, 지역변수와 마찬가지로 소멸이 된다.

따라서 다음과 같이 이야기해도 틀리지 않는다.

"매개변수는 지역변수이다!"

하지만 그 역은 성립하지 않는다. 왜냐하면 모든 지역변수가 매개변수는 아니기 때문이다.
즉, 지역변수는 매개변수를 포함하는 개념이다.

참고
- 자동변수(automatic variable)
지역변수를 가리켜 '자동변수'라고도 한다. 선언된 영역을 벗어나면서 자동으로 소멸되기 때문에 붙여진 이름이다.
*/