#include <stdio.h>
void Add(int val);
int num; // 전억변수는 기본 0으로 초기화됨

int main(void) {
	printf("num : %d \n", num);

	Add(3);
	printf("num : %d \n", num);
	num++; // 전역변수 num의 값 1 증가
	printf("num : %d \n", num);

	return 0;
}

void Add(int val) {
	num += val; // 전역변수 num의 값 val만큼 증가
}

/*
'전역변수'는 앞서 설명한 지역변수와 그 성격이 비교되는 변수이다.
지금껏 우리가 선언해 본 적 없는 이 변수는 프로그램이 처음 실행되면 메모리 공간에 할당되어서
프로그램이 종료될 때까지 메모리 공간에 남아있는 변수이다.

전역변수는 그 이름이 의미하듯이 어디서든 접근이 가능한 변수로써 지역변수와 달리 중괄호 내에 선언되지 않는다.

위 예제의 3행에 선언된 변수는 어떠한 중괄호에도 포함되지 않았다. 이렇게 선언되는 변수를 가리켜
'전역변수'라 하는데, 전역변수는 다음의 특징을 지닌다.

* 프로그램의 시작과 동시에 메모리 공간에 할당되어 종료 시까지 존재한다.
* 별도의 값으로 초기화되지 않으면 0으로 초기화된다.
* 프로그램 전체 영역 어디서든 접근이 가능하다.

이 중에서 '초기화하지 않으면 0으로 초기화된다'는 특징은 위 예제의 실행결과를 통해서 확인이 가능하다.
그리고 '프로그램 전체 영역 어디서든 접근 가능하다'는 사실도 실행결과를 통해서 확인할 수 있다.
즉 위 예제에서 접근하는 변수 num은 전역변수 num이다.(num이라는 이름의 다른 변수는 선언되어 있지 않다)
*/